hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v1/TAL_VBL_TAM/RUEM-PV.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
        xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v1"
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <updateOrder xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderService/v1">
            <order>
                <geschaeftsfall>VBL</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Anbieterwechsel</geschaeftsfallart>
            </order>
            <message>
                <RUEM-PV>
                    <meldungsattribute>
                        <vertragsnummer>${contractId}</vertragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                        <abgebenderProvider>
                            <providername>AugustaKom</providername>
                            <zustimmungProviderwechsel>J</zustimmungProviderwechsel>
                        </abgebenderProvider>
                        <TAL>
                            <leitung>
                                <leitungsbezeichnung>
                                    <leitungsschluesselzahl>52B</leitungsschluesselzahl>
                                    <onkzA>89</onkzA>
                                    <onkzB>4401</onkzB>
                                    <ordnungsnummer>1000000000</ordnungsnummer>
                                </leitungsbezeichnung>
                            </leitung>
                        </TAL>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0021</meldungscode>
                            <meldungstext>Antwort des abgebenden Providers</meldungstext>
                        </position>
                    </meldungspositionen>
                </RUEM-PV>
            </message>
        </updateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
